1. Изучить HashMap – написать что вы поняли о HashMap


2. Написать через функциональные интерфейсы цепочку обработчиков класса Person, которые:
   а) меняют маму с папой местами (такие времена)
   б) логгируют “changed” (System.out.println())

   Код должен быть гибким и без костылей. Учесть, что обработчиков может быть больше (допустим 20) и код должен выглядеть
   не менее опрятно.
   В роли цепочки использовать обычную коллекцию.


3. Написать программу, которая в 3 потока увеличивает единичку до 30001. Кол-во инкрементаций в каждом потоке по 10000.


4. Интерфейс Iterable предоставляет итератор и метод forEach. В каких случаях forEach не сможет сделать то, что может
   итератор? Потыкайте, повыдумывайте кейсы

